/*
* 修饰符
*/
#include<stdio.h>
#include<math.h>

int main(){
	//使用长度修饰符l创造出%ld,%lo,%lx和%lu作为新的格式码。
	printf("%ld",15829542671);
	
	//利用宽度修饰符可轻松做到在固定长度的域内打印数值。宽度修饰符出现在%符号和格式码中间。
	//如果待打印的数值不能填满位置，它的左侧就会被补上空格字符以使这个数值的宽度满足要求。
	//如果待打印的数值太大而超过了给定的域宽，输出域就会适当调整以容纳该数值。
	printf("\n%2d\n%2d*\n",2,100);
	
	//宽度修饰符对所有的格式码都有效，甚至%%也不例外。
	printf("%3%\n");
	
	//精度修饰符可控制一个数值的表示中将要出现的数字位数。
	//对于整数格式项%d/%o/%x/%u，精度修饰符指定了打印数字的最少位数。
	printf("%.2d/%.2d/%.4d\n",7,14,1789);
	
	//对于%e/%E/%f格式项，精度修饰符指定了小数点后应该出现的数字位数。
	//仅当精度大于0时打印的数值中才会实际出现小数点
	double pi;
	pi = 4*atan(1.0);
	printf("%.0f %.1f %.2f %.3f %.6f %.10f\n",pi,pi,pi,pi,pi,pi);
	printf("%.0e %.1e %.2e %.10e\n",pi,pi,pi,pi,pi,pi);
	
	//对于%g和%G，精度修饰符指定了打印数值的有效数字位数
	//如果小数点后不跟数字则小数点也被删除
	printf("%.g %.1g %.2g %.4g %.8g\n",10/3.0,10/3.0,10/3.0,10/3.0,10/3.0);
	
	//对于%s格式项，精度修饰符指定了将要从相应的字符串中打印的字符数。
	//如果该字符串中包含的字符数少于精度修饰符所指定的字符数，输出的字符数就会少于精度修饰符指定的
	//数目。
	char *name = "name.xls";
	printf("...%.14s...\n",name);
	printf("...%14.14s...",name);//左侧填补空白字符以达到14个字符。
	return 0;
}