#include<stdio.h>

//指针数组和数组指针
//指针数组：首先它是一个数组，数组的元素都是指针，数组占多少个字节由数组本身决定。它是“储存指针的数组”的简称。如：int* p[10];
//数组指针：首先它是一个指针，它指向一个数组。在32 位系统下永远是占4 个字节，至于它指向的数组占多少字节，不知道。它是“指向数组的指针”的简称。如：int (*p)[10];
void main(){
	//再论a和&a的区别
	char a[5] = {'A','B','C','D'};
	char (*p3)[5] = &a;//指向数组的指针
	char (*p5)[10] = &a;//指向数组的指针
	//左边类型指向整个数组的指针，右边类型指向单个字符的指针
	char (*p4)[5] = a;//=号两边的数据类型必须相同的，如果不同需要显示或隐式的类型转换
	printf("&a *p3[0] = %c,p3[0] = %c,p3[1] = %c,*p3[1] = %c\n",*p3[0],p3[0],p3[1],*p3[1]);
	printf("&a p4[0] = %c,p4[1] = %c\n",p4[0],p4[1]);
	printf("&a p5[0] = %c,p5[0] = %c,p5[1] = %c\n",*p5[0],p5[0],p5[1]);
	printf("\naddress a[0] = %p,a[1] = %p",&a[0],&a[1]);
	printf("\naddress a = %p,a+1 = %p",&a,&a+1);
	printf("\naddress p3 = %p,p3+1 = %p",p3,p3+1);
	printf("\naddress p4 = %p,p4+1 = %p",p4,p4+1);
	printf("\naddress p5 = %p,p5+1 = %p",p5,p5+1);
}